app/Controllers/CompareController.php

SELECT `vehicles`.`id`, `vehicles`.`name`, `vehicles`.`slug`, `brands`.`name` as `brand_name`
FROM `vehicles`
LEFT JOIN `brands` ON `brands`.`id` = `vehicles`.`brand_id`
WHERE `vehicles`.`status` = 'published'
ORDER BY `brands`.`name` ASC, `vehicles`.`name` ASC
---
    public function index()
    {
        $vehicleModel = new VehicleModel();

        // Accept comma-separated slugs or IDs
        $param    = trim((string) $this->request->getGet('vehicles'));
        $vehicles = [];

        if ($param !== '') {
            $tokens = array_filter(array_map('trim', explode(',', $param)));
            if (!empty($tokens)) {
                // Detect whether tokens look like IDs (all numeric) or slugs
                $allNumeric = array_reduce($tokens, fn($carry, $t) => $carry && ctype_digit($t), true);

                $query = $vehicleModel
                    ->withBrandCategory()
                    ->where('vehicles.status', 'published');

                if ($allNumeric) {
                    $query->whereIn('vehicles.id', $tokens);
                } else {
                    $query->whereIn('vehicles.slug', $tokens);
                }

                $vehicles = array_slice($query->findAll(), 0, 3);
            }
        }

        // All published vehicles for the selector dropdown (id, name, brand, slug only)
        $allVehicles = $vehicleModel
            ->select('vehicles.id, vehicles.name, vehicles.slug, brands.name as brand_name')
            ->join('brands', 'brands.id = vehicles.brand_id', 'left')
            ->where('vehicles.status', 'published')
            ->orderBy('brands.name', 'ASC')
            ->orderBy('vehicles.name', 'ASC')
            ->findAll();