app/Controllers/HomeController.php

SELECT `vehicles`.*, `brands`.`name` AS `brand_name`, `brands`.`slug` AS `brand_slug`, `brands`.`logo` AS `brand_logo`, `vehicle_categories`.`name` AS `category_name`, `vehicle_categories`.`slug` AS `category_slug`, `vehicle_categories`.`icon` AS `category_icon`
FROM `vehicles`
LEFT JOIN `brands` ON `brands`.`id` = `vehicles`.`brand_id`
LEFT JOIN `vehicle_categories` ON `vehicle_categories`.`id` = `vehicles`.`category_id`
WHERE `vehicles`.`status` = 'published'
AND `vehicles`.`featured` = 1
ORDER BY `vehicles`.`expert_rating` DESC
 LIMIT 6
SELECT `brands`.*, COUNT(vehicles.id) as vehicle_count
FROM `brands`
LEFT JOIN `vehicles` ON `vehicles`.`brand_id` = `brands`.`id` AND `vehicles`.`status` = "published"
WHERE `brands`.`status` = 'published'
GROUP BY `brands`.`id`
ORDER BY `vehicle_count` DESC
SELECT *
FROM `articles`
WHERE `status` = 'published'
ORDER BY `published_at` DESC
 LIMIT 4
---
    public function index()
    {
        $vehicleModel  = new VehicleModel();
        $brandModel    = new BrandModel();
        $articleModel  = new ArticleModel();
        $categoryModel = new CategoryModel();

        // Featured vehicles — up to 6 published + featured, best rated first
        $featuredVehicles = $vehicleModel
            ->withBrandCategory()
            ->where('vehicles.status', 'published')
            ->where('vehicles.featured', 1)
            ->orderBy('vehicles.expert_rating', 'DESC')
            ->limit(6)
            ->findAll();

        // Popular brands — all published brands with a vehicle count
        $popularBrands = $brandModel
            ->select('brands.*, COUNT(vehicles.id) as vehicle_count')
            ->join('vehicles', 'vehicles.brand_id = brands.id AND vehicles.status = "published"', 'left')
            ->where('brands.status', 'published')
            ->groupBy('brands.id')
            ->orderBy('vehicle_count', 'DESC')
            ->findAll();

        // Latest articles — 4 most recently published
        $latestArticles = $articleModel
            ->where('status', 'published')
            ->orderBy('published_at', 'DESC')
            ->limit(4)
            ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `vehicles`
WHERE `status` = 'published'
SELECT COUNT(*) AS `numrows`
FROM `brands`
WHERE `status` = 'published'
---
        $featuredCategories = $categoryModel->getTopLevel();

        // Site-wide stats
        $totalVehicles = $vehicleModel->where('status', 'published')->countAllResults();
        $totalBrands   = $brandModel->where('status', 'published')->countAllResults();